ch32-rs/ch32-rs/svd/fixed/ch32v3.svd
        <register>
          <name>AHBRSTR</name>
          <displayName>AHBRSTR</displayName>
          <description>AHB reset register
          (RCC_APHBRSTR)</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>USBHDRST</name>
              <description>USBHD reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DVPRST</name>
              <description>DVP reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETHMACRST</name>
              <description>Ethernet MAC reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
	<register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>Clock configuration register2
          (RCC_CFGR2)</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PREDIV1</name>
              <description>PREDIV1 division factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PREDIV2</name>
              <description>PREDIV2 division factor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PLL2MUL</name>
              <description>PLL2 Multiplication Factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PLL3MUL</name>
              <description>PLL3 Multiplication Factor</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PREDIV1SRC</name>
              <description>PREDIV1 entry clock source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S2SRC</name>
              <description>I2S2 clock source</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S3SRC</name>
              <description>I2S3 clock source</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		      	<field>
              <name>TRNG_SRC</name>
              <description>TRNG clock source</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		      	<field>
              <name>ETH1G_SRC</name>
              <description>ETH1G clock source</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
		      	<field>
              <name>ETH1G_125M_EN</name>
              <description>ETH1G _125M clock enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		      	<field>
              <name>USBHS_PREDIY</name>
              <description>USB HS PREDIV division factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
			<field>
              <name>USBHS_PLL_SRC</name>
              <description>USB HS Multiplication Factor clock source</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>USBHS_CKPEF_SEL</name>
              <description>USB HS Peference Clock source </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>USBHS_PLLALIVE</name>
              <description>USB HS Multiplication control </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>USBHS_CLK_SRC</name>
              <description>USB HS clock source </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTEND</name>
      <description>Extend configuration</description>
      <groupName>EXTEND</groupName>
      <baseAddress>0x40023800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTEND_CTR</name>
          <displayName>EXTEND</displayName>
          <description>EXTEND register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000A00</resetValue>
          <fields>
            <field>
              <name>USBDLS</name>
              <description>USBD Lowspeed Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBDPU</name>
              <description>USBD pullup Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETH_10M_EN</name>
              <description>ETH 10M Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETH_RGMII_EN</name>
              <description>ETH RGMII Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_HSI_PRE</name>
              <description>Whether HSI is divided </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUP_EN</name>
              <description>LOCKUP_Eable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCKUP_RSTF</name>
              <description>LOCKUP RESET</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULLDO_TRIM</name>
              <description>ULLDO_TRIM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_TRIM</name>
              <description>LDO_TRIM</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSE_KEEP_LP</name>
              <description>HSE_KEEP_LP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
