ch32-rs/ch32-rs/svd/fixed/ch32v3.svd
			<register>
			<name>UEP11_MAX_LEN</name>
			<description>endpoint 11 max acceptable length</description>
			<addressOffset>0xC4</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP11_MAX_LEN</name>
					<description>endpoint 11 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP12_MAX_LEN</name>
			<description>endpoint 12 max acceptable length</description>
			<addressOffset>0xC8</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP12_MAX_LEN</name>
					<description>endpoint 12 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP13_MAX_LEN</name>
			<description>endpoint 13 max acceptable length</description>
			<addressOffset>0xCC</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP13_MAX_LEN</name>
					<description>endpoint 13 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP14_MAX_LEN</name>
			<description>endpoint 14 max acceptable length</description>
			<addressOffset>0xD0</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP14_MAX_LEN</name>
					<description>endpoint 14 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP15_MAX_LEN</name>
			<description>endpoint 15 max acceptable length</description>
			<addressOffset>0xD4</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP15_MAX_LEN</name>
					<description>endpoint 15 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP0_T_LEN</name>
			<description>endpoint 0 send the length</description>
			<addressOffset>0xD8</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP0_T_LEN</name>
					<description>endpoint 0 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP0_T_CTRL</name>
			<description>endpoint 0  send control</description>
			<addressOffset>0xDA</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description>endpoint 0 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description>endpoint 0 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_T_TOG_AUTO</name>
					<description>endpoint 0 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP0_R_CTRL</name>
			<description>endpoint 0  send control</description>
			<addressOffset>0xDB</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description>endpoint 0 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description>endpoint 0 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_R_TOG_AUTO</name>
					<description>endpoint 0 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP1_T_LEN</name>
			<description>endpoint 1 send the length</description>
			<addressOffset>0xDC</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP1_T_LEN</name>
					<description>endpoint 1 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP1_T_CTRL</name>
			<description>endpoint 1  send control</description>
			<addressOffset>0xDE</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description>endpoint 1 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description>endpoint 1 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_T_TOG_AUTO</name>
					<description>endpoint 1 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP1_R_CTRL</name>
			<description>endpoint 1  send control</description>
			<addressOffset>0xDF</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description>endpoint 1 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description>endpoint 1 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_R_TOG_AUTO</name>
					<description>endpoint 1 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP2_T_LEN__UH_EP_PID</name>
			<description>endpoint 2 send the length</description>
			<addressOffset>0xE0</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP2_T_LEN__MASK_UH_ENDP__MASK_UH_TOKEN</name>
					<description>endpoint 2 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP2_T_CTRL</name>
			<description>endpoint 2  send control</description>
			<addressOffset>0xE2</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description>endpoint 2 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description>endpoint 2 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_T_TOG_AUTO</name>
					<description>endpoint 2 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP2_R_CTRL__UH_RX_CTRL</name>
			<description>endpoint 2 send control</description>
			<addressOffset>0xE3</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES__MASK_UH_R_RES</name>
					<description>endpoint 2 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>bUH_R_RES_NO</name>
					<description>bUH_R_RES_NO</description>
					<bitRange>[2:2]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG__MASK_UH_R_TOG</name>
					<description>endpoint 2 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_R_TOG_AUTO__bUH_R_AUTO_TOG</name>
					<description>endpoint 2 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			<field>
			<name>bUH_R_DATA_NO</name>
					<description>bUH_R_DATA_NO</description>
					<bitRange>[6:6]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP3_T_LEN___UH_TX_LEN_H</name>
			<description>endpoint 3 send the length</description>
			<addressOffset>0xE4</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP3_T_LEN___UH_TX_LEN_H</name>
					<description>endpoint 3 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP3_T_CTRL___UH_TX_CTRL</name>
			<description>endpoint 3  send control</description>
			<addressOffset>0xE6</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES_____MASK_UH_T_RES</name>
					<description>endpoint 3 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>bUH_T_RES_NO</name>
					<description>bUH_T_RES_NO</description>
					<bitRange>[2:2]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG____MASK_UH_T_TOG</name>
					<description>endpoint 3 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>bUEP_T_TOG_AUTO____bUH_T_AUTO_TOG</name>
					<description>endpoint 3 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>

			<field>
			<name>bUH_T_DATA_NO</name>
					<description>bUH_T_DATA_NO</description>
					<bitRange>[6:6]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP3_R_CTRL</name>
			<description>endpoint 3  send control</description>
			<addressOffset>0xE7</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description>endpoint 3 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description>endpoint 3 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>bUEP_R_TOG_AUTO</name>
					<description>endpoint 3 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP4_T_LEN</name>
			<description>endpoint 4 send the length</description>
			<addressOffset>0xE8</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP4_T_LEN</name>
					<description>endpoint 0 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP4_T_CTRL</name>
			<description>endpoint 4  send control</description>
			<addressOffset>0xEA</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description>endpoint 4 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description>endpoint 4 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_T_TOG_AUTO</name>
					<description>endpoint 4 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP4_R_CTRL</name>
			<description>endpoint 4  send control</description>
			<addressOffset>0xEB</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description>endpoint 4 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description>endpoint 4 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_R_TOG_AUTO</name>
					<description>endpoint 4 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP5_T_LEN</name>
			<description>endpoint 5 send the length</description>
			<addressOffset>0xEC</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP5_T_LEN</name>
					<description>endpoint 5 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP5_T_CTRL</name>
			<description>endpoint 5  send control</description>
			<addressOffset>0xEE</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description>endpoint 5 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description>endpoint 5 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_T_TOG_AUTO</name>
					<description>endpoint 5 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP5_R_CTRL</name>
			<description>endpoint 5  send control</description>
			<addressOffset>0xEF</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description>endpoint 5 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description>endpoint 5 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_R_TOG_AUTO</name>
					<description>endpoint 5 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP6_T_LEN</name>
			<description>endpoint 6 send the length</description>
			<addressOffset>0xF0</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP6_T_LEN</name>
					<description>endpoint 6 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP6_T_CTRL</name>
			<description>endpoint 6  send control</description>
			<addressOffset>0xF2</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description>endpoint 6 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description>endpoint 6 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_T_TOG_AUTO</name>
					<description>endpoint 6 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP6_R_CTRL</name>
			<description>endpoint 6  send control</description>
			<addressOffset>0xF3</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description>endpoint 6 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description>endpoint 6 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_R_TOG_AUTO</name>
					<description>endpoint 6 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>

						<register>
			<name>UEP7_T_LEN</name>
			<description>endpoint 7 send the length</description>
			<addressOffset>0xF4</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP7_T_LEN</name>
					<description>endpoint 7 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP7_T_CTRL</name>
			<description>endpoint 7  send control</description>
			<addressOffset>0xF6</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description>endpoint 7 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description>endpoint 7 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_T_TOG_AUTO</name>
					<description>endpoint 7 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP7_R_CTRL</name>
			<description>endpoint 7 send control</description>
			<addressOffset>0xF7</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description>endpoint 7 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description>endpoint 7 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_R_TOG_AUTO</name>
					<description>endpoint 7 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>

						<register>
			<name>UEP8_T_LEN</name>
			<description>endpoint 8 send the length</description>
			<addressOffset>0xF8</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP8_T_LEN</name>
					<description>endpoint 8 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP8_T_CTRL</name>
			<description>endpoint 8  send control</description>
			<addressOffset>0xFA</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_T_RES</name>
					<description>endpoint 8 control of the send response to IN transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_T_TOG</name>
					<description>endpoint 8 synchronous trigger bit for the sender to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_T_TOG_AUTO</name>
					<description>endpoint 8 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP8_R_CTRL</name>
			<description>endpoint 8  send control</description>
			<addressOffset>0xFB</addressOffset>
			<size>0x08</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>MASK_UEP_R_RES</name>
					<description>endpoint 8 control of the accept response to OUT transactions</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
			</field>
			<field>
			<name>MASK_UEP_R_TOG</name>
					<description>endpoint 8 synchronous trigger bit for the accept to prepare</description>
					<bitRange>[4:3]</bitRange>
					<access>read-write</access>
			</field>
				<field>
			<name>bUEP_R_TOG_AUTO</name>
					<description>endpoint 8 synchronous trigger bit automatic filp enables the control bit</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP9_T_LEN</name>
			<description>endpoint9 send the length</description>
			<addressOffset>0xFC</addressOffset>
			<size>0x10</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP9_T_LEN</name>
					<description>endpoint 9 send the length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
